// ============================================================================
const name = ('Задачи н основы работы с DOM в JS');
console.log('Урок № 19 ' + name);
// ============================================================================

// ============================================================================
console.log('1. Повторите страницу под анному образцу');
// ============================================================================

function clickBtn(elem) {
  elem = 'Привет!';
  document.write(elem);
}

// ============================================================================
console.log('2. Повторите страницу под анному образцу');
// ============================================================================

function overBtn(elem) {
  elem = 'Привет!';
  document.write(elem);
}

// ============================================================================
console.log('3. Повторите страницу под анному образцу');
// ============================================================================

function dblClickBtn(elem) {
  elem = 'Привет!';
  document.write(elem);
}

// ============================================================================
console.log('4. Повторите страницу под анному образцу');
// ============================================================================

function outClickBtn(elem) {
  elem = 'Привет!';
  document.write(elem);
}

// ============================================================================
console.log('5. Повторите страницу под анному образцу');
// ============================================================================

function clickBntToText() {
  const elem = document.getElementById('text');
  document.write(elem.value);
}

// ============================================================================
console.log('6. Повторите страницу под анному образцу');
// ============================================================================

function clickBntToChange() {
  const elem = document.getElementById('text2');
  elem.value = 'Ой, я поменял свой текст!';
}

// ============================================================================
console.log('7. Повторите страницу под анному образцу');
// ============================================================================

function clickToChangePhoto() {
  const elem = document.getElementById('monkey');
  elem.src = 'img/2.jpg';
}

// ============================================================================
console.log('8. Повторите страницу под анному образцу');
// ============================================================================

function clickByText() {
  const text = document.getElementById('text3');
  document.write(text.value);
}

// ============================================================================
console.log('9. Повторите страницу под анному образцу');
// ============================================================================

function clickByText2() {
  const text = document.getElementById('text4');
  text.value = 'Ой, поменял текст';
}

// ============================================================================
console.log('10. Повторите страницу под анному образцу');
// ============================================================================

function clickByText3() {
  const text = document.getElementById('text5');
  text.value = 'Ой, поменял текст!';
}

function blurByText3() {
  const text = document.getElementById('text5');
  text.value = 'Ой, теперь еще раз поменял!';
}

// ============================================================================
console.log('11. Повторите страницу по данному образцу');
// ============================================================================

function clickMyButton(button) {
  myButton.value = 'Ку-Ку';

  // or

  button.value = 'Ку-Ку';
}

// ============================================================================
console.log('12. Повторите страницу по данному образцу');
// ============================================================================

function blockMyButton() {
  blockButton.disabled = true;
  blockButton.value = 'О, теперь на меня больше не нажать';
}

// ============================================================================
console.log('13. Повторите страницу по данному образцу');
// ============================================================================

function overMyImg() {
  monkey2.src = 'img/2.jpg';
}

function outMyImg() {
  monkey2.src = 'img/1.jpg';
}

// ============================================================================
console.log('14. Повторите страницу по данному образцу');
// ============================================================================

function clickMyBtn() {
  const input = document.getElementById('redText');
  input.style.color = '#f00';
  input.style.width = '300px';
}

// ============================================================================
console.log('15. Повторите страницу по данному образцу');
// ============================================================================

function closeMyBtn() {
  closeText.style.display = 'none';
}

function openMyBtn() {
  closeText.style.display = 'inline-block';
}

// ============================================================================
console.log('16. Повторите страницу по данному образцу');
// ============================================================================

function changeMyText() {
  changeText.style.color = '#f00';
  changeText.value = 'Ой, я поменял свой текст и css!';
  changeText.style.width = '300px';
  changeText.style.height = '50px';
  changeText.style.borderRadius = '10px';
}

// ============================================================================
console.log('17. Повторите страницу по данному образцу');
// ============================================================================

function changeMyBtn() {
  doubleBtn.value = 'О, теперь на меня больне на нажать!';
  doubleBtn.disabled = true;
  openedBtn.style.display = 'inline-block';
  openedBtn.value = 'Нажми чтобы разблокировать элемент';
}

function openedMyBtn() {
  doubleBtn.disabled = false;
  doubleBtn.value = 'О, на меня сново можно нажать!';
  openedBtn.style.display = 'none';
}

// ============================================================================
console.log('18. Повторите страницу по данному образцу');
// ============================================================================

function clickToNumber() {
  toNumber.value = Number(toNumber.value) + 1;
}

// ============================================================================
console.log('19. Повторите страницу по данному образцу');
// ============================================================================

function clickButton() {
  toLeft.style.cssFloat = 'right';
  toLeft.value = 'Теперь я плаваю справа!';
}

// ============================================================================
console.log('20. Повторите страницу по данному образцу');
// ============================================================================

function clickButton2() {
  writeNew.value = 'Мои css классы: ' + writeNew.className;
}

// ============================================================================
console.log('21. Повторите страницу по данному образцу');
// ============================================================================

function clickHelloBye() {
  var hello2 = hello.value;
  var buy2 = buy.value;
  hello.value = buy2;
  buy.value = hello2;
}

// ============================================================================
console.log('22. Повторите страницу по данному образцу');
// ============================================================================

function clicktoButton() {
  amountNumber.value = numberId.value * numberId.value;
}

// ============================================================================
console.log('23. Повторите страницу по данному образцу');
// ============================================================================

function clicktoButton2() {
  amountNumber2.value = numberId2.value * numberId2.value;
  if (isNaN(amountNumber2.value)) {
    alert('Не число');
    numberId2.value = 'Введите число!';
  }
}

// ============================================================================
console.log('24. Повторите страницу по данному образцу');
// ============================================================================

function clicktoBlock() {
  toBlock.disabled = true;
  toBlock.style.cursor = 'not-allowed';
}

// ============================================================================
console.log('25. Повторите страницу по данному образцу');
// ============================================================================

function clickToAdd(elem) {
  count.value = count.value + elem;
}
