// ============================================================================
var name = 'Функции работы с массивами';
console.log('Урок № 8 - ' + name);
// ============================================================================


// ============================================================================

/*
Переменная lang может принимать два значения: 'ru' и 'en'. Переменная month
может принимать значения от 0 до 11.
Если lang имеет значение 'ru', то выведем название месяца, соответствующего
содержимому переменной month, на русском языке, а если имеет значение 'en' –
то на английском.
*/

var monthes = { ru: ['Явнварь', 'Февраль'], en: ['January', 'February'] };
console.log(monthes.ru[0]);
var lang = 'en';
var month = 1;
console.log(monthes[lang][month]);


// ============================================================================
console.log('Работа с concat');
// ============================================================================

// 1. Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.

var arrayFirst = [1, 2, 3];
var arraySecond = [4, 5, 6];
var together;
together = arrayFirst.concat(arraySecond);
console.log(together);

// or

var arrayFirst = [1, 2, 3];
var arraySecond = [4, 5, 6];
var together;
together = arrayFirst.push(arraySecond[0], arraySecond[1], arraySecond[2]);
console.log(arrayFirst);

// ============================================================================
console.log('Работа reverse');
// ============================================================================

// 2. Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].

var array = [1, 2, 3];
array.reverse();
console.log(array);

// ============================================================================
console.log('Работа с push и unshift');
// ============================================================================

// 3. Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.

var array = [1, 2, 3];
array.push(4, 5, 6);
console.log(array);

// ============================================================================

// 4. Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.

var array = [1, 2, 3];
array.unshift(4, 5, 6);
console.log(array);

// ============================================================================
console.log('Работа с shift, pop');
// ============================================================================

// 5. Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.

var array = ['js', 'css', 'jq'];
console.log(array.shift());

// ============================================================================

// 6. Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.

var array = ['js', 'css', 'jq'];
console.log(array.pop());

// ============================================================================
console.log('Работа с slice');
// ============================================================================

/*
7. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый
элементы [1, 2, 3].
*/

var array = [1, 2, 3, 4, 5];
console.log(array.slice(0, 3));

// ============================================================================

/*
8. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы
[4, 5].
*/

var array = [1, 2, 3, 4, 5];
var result = array.slice(3);
console.log(result);

// ============================================================================
console.log('Работа с splice');
// ============================================================================

/*
9. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в
[1, 4, 5].
*/

var array = [1, 2, 3, 4, 5];
array.splice(1, 2);
console.log(array);

// ============================================================================

/*
10. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив
элементы [2, 3, 4].
*/

var array = [1, 2, 3, 4, 5];
var arrayNew = array.splice(1, 3);
console.log(arrayNew);

// ============================================================================

/*
11. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив
[1, 2, 3, 'a', 'b', 'c', 4, 5].
*/

var array = [1, 2, 3, 4, 5];
array.splice(3, 0, 'a', 'b', 'c');
console.log(array);

// ============================================================================

/*
12. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив
[1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
*/

var array = [1, 2, 3, 4, 5];
array.splice(1, 4, 'a', 'b', 2, 3, 4, 'c', 5, 'e');
console.log(array);

// or

var array = [1, 2, 3, 4, 5];
array.splice(1, 0, 'a', 'b');
array.splice(6, 0, 'c');
array.splice(8, 0, 'e');
console.log(array);

// ============================================================================
console.log('Работа с sort');
// ============================================================================

// 13. Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.

var array = [3, 4, 1, 2, 7];
array.sort();
console.log(array);

// ============================================================================
console.log('Работа с Object.keys');
// ============================================================================

/*
14. Дан объект {js:'test', jq: 'hello', css: 'world'}. Получите массив
его ключей.
*/

var object = { js: 'test', jq: 'hello', css: 'world' };
console.log(Object.keys(object));
