// ============================================================================
var name = 'Работа с пользовательскими функциями в JS';
console.log('Урок № 10 - ' + name);
// ============================================================================


// ============================================================================

/*
1. Сделайте функцию, которая возвращает квадрат числа.
Число передается параметром.
*/

function cube(x) {
  return Math.pow(x, 2);
}

console.log(cube(2));

// or

function cube(x) {
  return x * x;
}

console.log(cube(2))

// ============================================================================

/*
2. Сделайте функцию, которая возвращает сумму двух чисел.
*/

function amount(a, b) {
  return a + b;
}

console.log(amount(5, 5));

// ============================================================================

/*
3. Сделайте функцию, которая отнимает от первого числа второе и
делит на третье.
*/

function equation(a, b, c) {
  return (a - b) / c;
}

console.log(equation(12, 6, 2));

// ============================================================================

/*
4. Сделайте функцию, которая принимает параметром число от 1 до 7,
а возвращает день недели на русском языке.
*/

function dayWeek(num) {
  var obj = { 1: 'пн', 2: 'вт', 3: 'ср', 4: 'чт', 5: 'пт', 6: 'сб', 7: 'вс' };
  if (num <= 7) {
    return obj[num];
  } else {
    return 'Введите значения от 1 до 7!';
  }
}

console.log(dayWeek(8));

// or

function dayWeek(num) {
  var array = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
  if (num <= 7) {
    return array[num - 1];
  } else {
    return 'Введите значения от 1 до 7';
  }
}

console.log(dayWeek(7));
