// ============================================================================
var name = 'Работа с математическими функциями';
console.log('Урок № 6 - ' + name);
// ============================================================================

// ============================================================================
console.log('Работа с %');
// ============================================================================

/*
1. Даны переменные a = 10 и b = 3. Найдите остаток от деления a на b.
*/

var a = 10;
var b = 3;
var result = a % b;
console.log(result);

// ============================================================================

/*
2. Даны переменные a и b. Проверьте, что a делится без остатка на b. Если это
так - выведите 'Делится' и результат деления, иначе выведите
'Делится с остатком' и остаток от деления.
*/

var a = 2;
var b = 10;
var result = b % a;
if (result == 0) {
  console.log('Делиться: ' + 'ответ - ' + b / 2);
} else if (result != 0) {
  console.log('Делиться с остатком: ' + 'остаток - ' + result);
}

var a = 3;
var b = 10;
var result = b % a;
if (result == 0) {
  console.log('Делиться: ' + 'ответ - ' + b / a);
} else if (result != 0) {
  console.log('Делиться с остатком: ' + 'остаток - ' + result);
}

// ============================================================================
console.log('Работа со степенью и кормем');
// ============================================================================

/*
3. Возведите 2 в 10 степень. Результат запишите в переменную st.
*/

var st = console.log(Math.pow(2, 10));

// ============================================================================

/*
4. Найдите квадратный корень из 245.
*/

var num = 245;
console.log(Math.sqrt(num));

// ============================================================================

/*
5. Дан массив с элементами 4, 2, 5, 19, 13, 0, 10. Найдите квадратный корень из
суммы кубов его элементов. Для решения воспользуйтесь циклом for.
*/

var array = [4, 2, 5, 19, 13, 0, 10];
var result = 0;

for (var i = 0; i < array.length; i++) {
  result = result + Math.pow(array[i], 3);
}

console.log(Math.sqrt(result));

// ============================================================================
console.log('Работа с функциями округления');
// ============================================================================

/*
6. Найдите квадратный корень из 379. Результат округлите до целых, до десятых,
 до сотых.
*/

var num = Math.sqrt(379);
console.log('Результат квадратного корня из 379 - ' + num);

console.log('Результат округления до целых функцией Math.round - ' + Math.round(num));
// or
console.log('Результат округления до целых функцией floor - ' + Math.floor(num));
// or
console.log('Результат округления до целых функцией parseInt - ' + parseInt(num));
// or
console.log('Результат округления до целых методом to.Precision - ' + (num.toPrecision(2)));
// or
console.log('Результат округления до целых методом toFixed - ' + (num.toFixed()));

console.log('Результат округления до десятых методом toPrecision - ' + (num.toPrecision(3)));
// or
console.log('Результат округления до десятых методом toFixed - ' + (num.toFixed(1)));

console.log('Результат округления до сотых методом toPrecision- ' + (num.toPrecision(4)));
// or
console.log('Результат округления до сотых методом toFixed - ' + (num.toFixed(2)));

// ============================================================================

/*
7. Найдите квадратный корень из 587. Округлите результат в большую и меньшую
стороны, запишите результаты округления в объект с ключами 'floor' и 'ceil'.
*/

var num = Math.sqrt(587);
console.log(num);

var object = { floor: Math.floor(num), ceil: Math.ceil(num) };
console.log('Результат округления floor = ' + object.floor);
console.log('Результат округления ceil = ' + object.ceil);

// ============================================================================
console.log('Нахождение максимального и минимального числа');
// ============================================================================

/*
8.  Даны числа 4, -2, 5, 19, -130, 0, 10. Найдите минимальное и максимальное
число.
*/

var array = [4, -2, 5, 19, -130, 0, 10];
console.log('Минимальнае число из массива = ' + Math.min.apply(null, array));
console.log('Максимальное число из массива = ' + Math.max.apply(null, array));

// or

console.log('Минимальное число = ' + Math.min(4, -2, 5, 19, -130, 0, 10));
console.log('Максимальное число = ' + Math.max(4, -2, 5, 19, -130, 0, 10));

// ============================================================================
console.log('Работа с рандомом');
// ============================================================================

/*
9. Выведите на экран случайное целое число от 1 до 100
*/

function getRandomInt(min, max) {
  return (Math.floor(Math.random() * (max - min + 1) + min));
}

console.log(getRandomInt(1, 100));

// or

console.log(Math.floor(Math.random() * (100 - 1 + 1) + 1));

// ============================================================================

/*
12. Заполните массив 10-ю случайными целыми числами.
*/

var array = [];
var min = 1;
var max = 100;
for (var i = 0; i < 10; i++) {
  array[i] = Math.floor(Math.random() * (max - min + 1) + min);
  console.log(array[i]);
}

// or

var max = 100;
var array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
for (var i = 0; i < array.length; i++) {
  array[i] = Math.floor(Math.random() * (max - array[i] + 1) + array[i]);
  console.log(array[i]);
}

// ============================================================================

/*
11. Даны переменные a и b. Найдите модуль разности a и b. Проверьте
работу скрипта самостоятельно для различных a и b.
*/

var a = 10;
var b = 12;
console.log(Math.abs(a - b));

// ============================================================================
console.log('Работа с модулем');
// ============================================================================


/*
12. Даны переменные a и b. Отнимите от a переменную b и результат присвойте
переменной c. Сделайте так, чтобы в любом случае в переменную c записалось
положительное значение. Проверьте работу скрипта при a и b,
равных соответственно 3 и 5, 6 и 1.
*/

var a = 3;
var b = 5;
var c = (Math.abs(a - b));
console.log(c);

var a = 6;
var b = 1;
var c = (Math.abs(a - b));
console.log(c);

// ============================================================================
console.log('Задачи');
// ============================================================================

/*
13. Дан массив arr. Найдите среднее арифметическое его элементов. Проверьте
задачу на массиве с элементами 12, 15, 20, 25, 59, 79.
*/

var arr = [12, 15, 20, 25, 59, 79];
var result = 0;
for (var i = 0; i < arr.length; i++) {
  arr[i] = arr[i] / arr.length;
  result = result + arr[i];
  console.log('Среднее арифметическое каждого элемента массива = ' + arr[i]);
}

var arr = [12, 15, 20, 25, 59, 79];
var result = 0;
for (var i = 0; i < arr.length; i++) {
  result = result + arr[i];
}

console.log('Среднее арифметическое элементов массива = ' + result / arr.length);

// ============================================================================

/*
14. Напишите скрипт, который будет находить факториал числа. Факториал
(обозначается !) - это произведение (умножение) всех целых чисел, меньше
данного, и его самого. Например, 4! = 1*2*3*4.
*/

var factorial = 5;
var count = 1;
var result = 1;
for (var i = 2; i <= factorial; i++) {
  count = count + '*' + i;
  result = result * i;
}

console.log(factorial + '! = ' + count + ' = ' + result);
