// ============================================================================
var name = 'Задачи на отработку циклов и функций JS';
console.log('Урок № 17 - ' + name);
// ============================================================================

// ============================================================================
console.log('Отработка циклов');
// ============================================================================

// 1. Выведите с помощью цикла столбец чисел от 1 до 100.

for (var i = 1; i <= 100; i++) {
  console.log(i);
}

// ============================================================================

// 2.Выведите с помощью цикла столбец чисел от 100 до 1

for (var i = 100; i >= 1; i--) {
  console.log(i);
}

// ============================================================================

// 3. Выведите с помощью цикла столбец четных чисел от 1 до 100.

for (var i = 2; i <= 100; i += 2) {
  console.log(i);
}

// or

for (var i = 1; i <= 50; i++) {
  var result = 0;
  result += i * 2;
  console.log(result);
}

// or

for (var i = 1; i <= 100; i++) {
  if (i % 2 === 0) {
    console.log(i);
  }
}

// ============================================================================

// 4. Заполните массив 10-ю иксами с помощью цикла.

var arr = [];
var x = 'x';
for (var i = 0; i < 10; i++) {
  arr.push(x);
}

console.log(arr);

// or

var arr = [];
var x = 'x';
for (var i = 0; i < 10; i++) {
  arr[i] = x;
}

console.log(arr);

// ============================================================================

// 5. Заполните массив числами от 1 до 10 с помощью цикла.

var arr = [];
for (var i = 1; i <= 10; i++) {
  arr.push(i);
}

console.log(arr);

// ============================================================================

/*
6. Заполните массив 10-ю случайными числами (дробями) от 0 до 1 с помощью цикла.
Дроби округляйте до двух знаков в дробной части.
*/

var arr = [];
for (var i = 0; i < 10; i++) {
  arr.push(+Math.random(i).toFixed(2));
}

console.log(arr);

// or

var arr = [];
for (var i = 0; i < 10; i++) {
  arr.push(+Math.random(i).toPrecision(2));
}

console.log(arr);

// ============================================================================

// 7. Заполните массив 10-ю случайными числами от 1 до 10 с помощью цикла.

var arr = [];
for (var i = 1; i <= 10; i++) {
  arr.push(Math.floor(Math.random() * (10 - 1 + 1) + 1));
}

console.log(arr);

// or

function getRandomNumber(min, max) {
  return Math.floor(Math.random() * (max - min + 1) + min);
}

var arr = [];
for (var i = 1; i <= 10; i++) {
  arr.push(getRandomNumber(1, 10));
}

console.log(arr);

// ============================================================================

/*
8. Дан массив с числами. С помощью цикла выведите только те элементы массива,
которые больше нуля и меньше 10-ти.
*/

var arr = [-15, -10, 2, 5, 6, 9, 10, 11, 16];
var newArr = [];
for (var i = 0; i <= arr.length; i++) {
  if (arr[i] > 0 && arr[i] < 10) {
    newArr.push(arr[i]);
  }
}

console.log(newArr);

// ============================================================================

/*
9. Дан массив с числами. С помощью цикла проверьте, что в нем есть элемент со
значением 5. Как только будет найден первый такой элемент - выведите 'Есть' и
оборвите цикл. Если такого элемента нет - ничего не выводите.
*/

var arr = [-15, -10, 2, 5, 6, 9, 10, 11, 16];
for (var i = 0; i < arr.length; i++) {
  if (arr[i] === 5) {
    console.log('Есть');
    break;
  }
}

// ============================================================================

/*
10. Дан массив с числами. С помощью цикла найдите сумму элементов
этого массива.
*/

var arr = [1, 2, 3, 4];
var result = 0;
for (var i = 0; i < arr.length; i++) {
  result += arr[i];
}

console.log(result);

// ============================================================================

/*
11. Дан массив с числами. С помощью цикла найдите сумму квадратов элементов
этого массива.
*/

var arr = [1, 2, 3, 4];
var result = 0;
for (var i = 0; i < arr.length; i++) {
  result += Math.pow(arr[i], 2);
}

console.log(result);

// or

var arr = [1, 2, 3, 4];
var result = 0;
for (var i = 0; i < arr.length; i++) {
  result += arr[i] * arr[i];
}

console.log(result);

// ============================================================================

/*
12. Дан массив с числами. Найдите среднее арифметическое его элементов
(сумма элементов, делить на количество).
*/

var arr = [1, 2, 3, 4];
var amount = 0;
for (var i = 0; i < arr.length; i++) {
  amount += arr[i] / arr.length;
}

console.log(amount);

// ============================================================================

// Дополнительно)

/*
13. Дан массив. С помощью цикла выведите только те элементы массива, которые
стоят на четных позициях (имеют четные ключи).
*/

var arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
var newArr = [];
for (var i = 0; i < arr.length; i++) {
  if (arr[i] % 2 != 0) {
    newArr.push(arr[i]);
  }
}

console.log(newArr);

// ============================================================================

// 14. Выведите на экран первые 20 штук чисел Фибоначчи.

var n1 = 0;
var n2 = 1;
var fib = n1 + n2;
var arr = [];
for (var i = 1; i < 20; i++) {
  if (i <= 2) {
    arr.push(fib);
  } else {
    n1 = n2;
    n2 = fib;
    fib = n1 + n2;
    arr.push(fib);
  }
}

console.log(arr);
